0hello-bit/Robot_twin/数字孪生/firmware/stm32_line_follower/User/main.c
#include "stm32f10x.h"
#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include "Delay.h"
#include "Motor.h"
#include "Sensor.h"
#include "mpu6050.h"
#include "twin_control_protocol.h"
#include "esp_runtime_transport.h"
#include "uart_ring.h"
#include "motor_register_diag.h"
#include "diag_one_shot.h"
#include "send_response_parser.h"
#include "cipsend_transaction.h"
#include "cipsend_tx.h"
#include "tx_frame_queue.h"
#include "esp_tx_coordinator.h"
#include "mono_time.h"
#include "mono_time_core.h"
#include "health_stats.h"
#include "health_frame.h"
#include "health_watchdog.h"
#include "telemetry_batch.h"

/******************************************************************************
 * ESP01S WiFi (TCP Server)
 ******************************************************************************/
#define WIFI_SSID   "@Ruijie-sC384"
#define WIFI_PWD    "xiang87777114"
#define TCP_PORT    8888

static void USART1_Init(uint32_t baud)
{
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1 | RCC_APB2Periph_GPIOA, ENABLE);
    GPIO_InitTypeDef gpio;
    gpio.GPIO_Pin = GPIO_Pin_9;
    gpio.GPIO_Mode = GPIO_Mode_AF_PP;
    gpio.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOA, &gpio);
    gpio.GPIO_Pin = GPIO_Pin_10;
    gpio.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOA, &gpio);
    USART_InitTypeDef usart;
    usart.USART_BaudRate = baud;
    usart.USART_WordLength = USART_WordLength_8b;
    usart.USART_StopBits = USART_StopBits_1;
    usart.USART_Parity = USART_Parity_No;
    usart.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    usart.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
    USART_Init(USART1, &usart);
    USART_Cmd(USART1, ENABLE);
}

static void ESP_Send(const char *cmd)
{
    while (*cmd) {
        while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET);
        USART_SendData(USART1, *cmd++);
    }
    while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET);
    USART_SendData(USART1, '\r');
    while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET);
    USART_SendData(USART1, '\n');
}

static void ESP_Flush(void)
{
    uint32_t t;
    for (t = 0; t < 200; t++)
        if (USART_GetFlagStatus(USART1, USART_FLAG_RXNE) != RESET)
            USART_ReceiveData(USART1);
}

#define STR(x) _STR(x)
#define _STR(x) #x

static void ESP_MarkDisconnected(void);

static void ESP_Setup(void)
{
    ESP_Flush();
    ESP_Send("AT");                    Delay_ms(1500);  ESP_Flush();
    ESP_Send("AT+CWMODE=1");           Delay_ms(1500);  ESP_Flush();
    ESP_Send("AT+CWJAP=\"" WIFI_SSID "\",\"" WIFI_PWD "\"");
                                       Delay_ms(10000); ESP_Flush();
    ESP_Send("AT+CIPMUX=1");           Delay_ms(1500);  ESP_Flush();
    ESP_Send("AT+CIPMODE=0");           Delay_ms(500);   ESP_Flush();
    ESP_Send("AT+CIPSERVER=1," STR(TCP_PORT));
                                       Delay_ms(1500);  ESP_Flush();
    ESP_MarkDisconnected();
}

/******************************************************************************
 * 遥测帧 (二进制协议, 与 wifi_bridge.py 对接)
 * 帧格式: 0xAA 0x55 TYPE LEN [payload] XOR_CHECKSUM
 ******************************************************************************/
static volatile uint8_t g_tcp_client_id = 0xFF;
static volatile uint8_t g_tcp_client_connected = 0;

/* SPSC UART RX ring — ISR pushes, main loop pops (control input path). */
UartRing g_uart_ring;
/* SPSC UART TX ring — main loop pushes, ISR pops (non-blocking TX). */
UartRing g_uart_tx_ring;
static uint8_t g_prev_connected = 0;

/* Retry buffers for critical A (ACK) and S (status) frames, scoped to the
   current connection generation (tx_frame_queue.h).  After a failed CIPSEND
   transaction, the frame is preserved here (not consumed from the transport
   layer retry buffer) so it can be retried on the next main-loop iteration.
   Telemetry and diagnostic frames are NOT retried — only A/S frames.
   On a new CONNECT (generation change) or a CLOSED terminal result, all
   retained frames are dropped so old critical frames are never sent to a
   new client (Task 4B-4 fix, Codex review remediation). */
static TxFrameQueue g_tx_queue;

/* Diagnostic one-shot state machine: arms exactly once on each transition
   from motion-inhibited to running.  Declared at file scope so both the
   inhibited branch and the running branch can update it. */
static DiagOneShot g_diag_state;

/* ── Task 4B-4 fix: 非阻塞 CIPSEND TX 状态机 ─────────────────────────
   CIPSEND 从同步阻塞 while 改为持久化非阻塞状态机（cipsend_tx.h）。
   同一时间只允许一个事务；每次主循环由 ESP_TX_Service 推进一小步。
   A/S 为高优先级可靠帧（重试缓冲）；telemetry/diag 可丢。 */

static CipsendTx g_cipsend_tx;

/* ── Task 4B-4 final fix: TX connection-boundary coordinator ──────────
   Single call site for all boundary-abort decisions.  Ensures no byte
   from the old connection epoch reaches the ESP UART after a new client
   CONNECTs.  See esp_tx_coordinator.h and tx_boundary_design_decision.md. */
static EspTxCoordinator g_coordinator;

/* ── Health baseline: 0x02 健康统计（主上下文单写者）。 ──────────────── */
static HealthStats g_health_stats;
static uint8_t g_reset_cause = 0U;      /* RCC->CSR 复位原因快照（开机读+清 RMVF） */
static uint32_t s_last_health_ms = 0U;  /* 1Hz health_emit 上次发射时刻 */
static uint8_t  s_health_frame[HEALTH_FRAME_TOTAL_LEN]; /* 延迟待发的 0x02 健康帧 */
static uint32_t s_last_tx_generation = 0U; /* 上次看到的连接代次（发送仲裁） */

/* TX-ring discard callback for the coordinator: disable TXE, drain the
   ring, leave TXE disabled.  uart_tx_sink re-enables TXE on next push.
   Returns the number of bytes discarded (observable). */
static uint16_t discard_tx_ring_cb(void *ctx)
{
    uint8_t dummy;
    uint16_t discarded = 0U;
    (void)ctx;
    USART_ITConfig(USART1, USART_IT_TXE, DISABLE);
    while (uart_ring_pop(&g_uart_tx_ring, &dummy)) {
        discarded++;
    }
    return discarded;
}

/* 遥测批量槽：最多保留最新 3 帧，ESP 忙时只丢可丢的最旧遥测。 */
static uint8_t s_tele_frame[TELEMETRY_BATCH_FRAME_SIZE];
static TelemetryBatch s_tele_batch;
/* Droppable TX is released only after the current sensor/control phase. */
static uint8_t s_control_cycle_ready;

/* 真实单调时间（mono_time.h / mono_time_core.h）。 */
static uint32_t s_last_telemetry_ms = 0U;
static uint32_t s_last_yaw_ms = 0U;

/* yaw dt 边界保护（ms）：零 dt 钳到 min，异常大间隔钳到 max。 */
#define YAW_DT_MIN_MS  1U
#define YAW_DT_MAX_MS  100U

/* UART TX 字节 sink：压入 TX ring 并启用 TXE 中断（非阻塞）。 */
static uint8_t uart_tx_sink(void *ctx, uint8_t byte)
{
    (void)ctx;
    if (!uart_ring_push(&g_uart_tx_ring, byte)) return 0U;
    USART_ITConfig(USART1, USART_IT_TXE, ENABLE);
    return 1U;
}

static void clear_telemetry_batch_cb(void *ctx)
{
    telemetry_batch_clear((TelemetryBatch *)ctx);
}

static void build_cipsend_cmd(char *cmd, uint16_t len)
{
    sprintf(cmd, "AT+CIPSEND=%d,%d\r\n", (int)g_tcp_client_id, (int)len);
}

static void ESP_MarkDisconnected(void)
{
    g_tcp_client_id = 0xFF;
    g_tcp_client_connected = 0;
    hstats_health_epoch_changed(&g_health_stats);  /* 断连 → 放弃待发健康帧 */
    twin_control_timeout();
}

/* 终态处理：成功清对应重试缓冲；ERROR/busy/超时保留（同代次内重试）；
   CLOSED 丢弃全部保留帧 + 强制 abort TX ring（连接已断，不得泄漏到
   下一连接）。等下一个 CONNECT 到来时 coordinator 会再做完整边界清理。 */
static void ESP_TX_HandleTerminal(void)
{
    /* Delegates to the extracted pure-logic function in esp_tx_coordinator,
       which is Host-testable via the same production code path.  See
       tx_boundary_design_decision.md §4 and §9. */
    etc_handle_terminal(&g_coordinator, mono_now_ms());
}

