0hello-bit/Robot_twin/数字孪生/firmware/stm32_line_follower/User/main.c
/* Phase 1: drain RX ring, route every byte to both the transport
   (CONNECT/CLOSED/+IPD) and the TX state machine ('>' / SEND OK parse). */
static void ESP_ServiceRX(void)
{
    uint8_t ch;
    while (uart_ring_pop(&g_uart_ring, &ch)) {
        esp_transport_process_byte(ch);        /* CONNECT/CLOSED/+IPD 输入路径 */
        cipsend_tx_feed_byte(&g_cipsend_tx, ch); /* TX 事务 '>' / SEND OK 解析 */
    }
}

/* Phase 2+3: check connection boundary, then push TX + handle terminal.
   Must run AFTER ESP_ServiceRX (which may have detected CONNECT/CLOSED)
   but BEFORE any main-loop logic that reads connection state. */
static void ESP_ServiceTX(void)
{
    uint32_t gen;
    /* Check boundary BEFORE pushing any TX bytes (see design decision §5).
       If a CONNECT arrived during ESP_ServiceRX, the coordinator discards
       the old CipsendTx, TX ring, tele slot, and A/S retry buffers so no
       old-epoch byte can reach the ESP. */
    (void)etc_check_boundary(&g_coordinator,
                             esp_transport_connection_generation(),
                             mono_now_ms());
    /* 连接代次变化 → 放弃旧代次待发健康帧（发送仲裁，不得发给新客户端）。 */
    gen = esp_transport_connection_generation();
    if (gen != s_last_tx_generation) {
        s_last_tx_generation = gen;
        hstats_health_epoch_changed(&g_health_stats);
    }
    cipsend_tx_tick(&g_cipsend_tx, mono_now_ms(), uart_tx_sink, NULL);
    ESP_TX_HandleTerminal();
}

/* 构建 29 字节遥测帧到 s_tele_frame（与旧 Telemetry_Send 布局一致）。 */
static void build_telemetry_frame(int16_t s0, int16_t s1, int16_t s2, int16_t s3,
                                  int16_t m1, int16_t m2, int16_t m3, int16_t m4,
                                  int16_t error, int16_t pid_output,
                                  uint32_t tick, int32_t yaw)
{
    uint8_t type = 0x01;
    uint8_t len  = 24;
    uint8_t cs   = type ^ len;
    uint8_t i;
    int32_t yaw_int = yaw;

    s_tele_frame[4]  = (uint8_t)(s0 & 0xFF);
    s_tele_frame[5]  = (uint8_t)(s1 & 0xFF);
    s_tele_frame[6]  = (uint8_t)(s2 & 0xFF);
    s_tele_frame[7]  = (uint8_t)(s3 & 0xFF);
    s_tele_frame[8]  = (uint8_t)(m1 & 0xFF);        s_tele_frame[9]  = (uint8_t)((m1 >> 8) & 0xFF);
    s_tele_frame[10] = (uint8_t)(m2 & 0xFF);        s_tele_frame[11] = (uint8_t)((m2 >> 8) & 0xFF);
    s_tele_frame[12] = (uint8_t)(m3 & 0xFF);        s_tele_frame[13] = (uint8_t)((m3 >> 8) & 0xFF);
    s_tele_frame[14] = (uint8_t)(m4 & 0xFF);        s_tele_frame[15] = (uint8_t)((m4 >> 8) & 0xFF);
    s_tele_frame[16] = (uint8_t)(error & 0xFF);     s_tele_frame[17] = (uint8_t)((error >> 8) & 0xFF);
    s_tele_frame[18] = (uint8_t)(pid_output & 0xFF);s_tele_frame[19] = (uint8_t)((pid_output >> 8) & 0xFF);
    s_tele_frame[20] = (uint8_t)(tick & 0xFF);
    s_tele_frame[21] = (uint8_t)((tick >> 8) & 0xFF);
    s_tele_frame[22] = (uint8_t)((tick >> 16) & 0xFF);
    s_tele_frame[23] = (uint8_t)((tick >> 24) & 0xFF);
    s_tele_frame[24] = (uint8_t)(yaw_int & 0xFF);
    s_tele_frame[25] = (uint8_t)((yaw_int >> 8) & 0xFF);
    s_tele_frame[26] = (uint8_t)((yaw_int >> 16) & 0xFF);
    s_tele_frame[27] = (uint8_t)((yaw_int >> 24) & 0xFF);

    for (i = 4; i < 28; i++) cs ^= s_tele_frame[i];

    s_tele_frame[0] = 0xAA;
    s_tele_frame[1] = 0x55;
    s_tele_frame[2] = type;
    s_tele_frame[3] = len;
    s_tele_frame[28] = cs;
}

/* 尝试把待发遥测交给 TX 状态机（仅当空闲且无 critical 待发）。 */
static void ESP_TrySendTelemetry(void)
{
    char cmd[24];
    uint16_t batch_len;
    if (!telemetry_batch_has_data(&s_tele_batch)) return;
    if (hstats_health_due(&g_health_stats)) return;  /* 健康帧优先：让行（仲裁） */
    if (cipsend_tx_busy(&g_cipsend_tx)) return;
    if (twin_control_has_pending_status()) return;
    if (!etc_telemetry_dispatch_allowed(
            s_control_cycle_ready,
            txfq_has_retry(&g_tx_queue),
            esp_transport_has_pending_ack(),
            esp_transport_has_pending_status(),
            twin_control_has_pending_status())) {
        return;  /* A/S 优先, including frames queued later this loop */
    }
    batch_len = telemetry_batch_length(&s_tele_batch);
    build_cipsend_cmd(cmd, batch_len);
    if (cipsend_tx_start(&g_cipsend_tx, cmd, (uint16_t)strlen(cmd),
                         telemetry_batch_data(&s_tele_batch), batch_len,
                         CIPSEND_TX_PRIORITY_DROPPABLE, CIPSEND_TX_TAG_TELEMETRY,
                         mono_now_ms())) {
        telemetry_batch_consume(&s_tele_batch);
        hstats_tx_started(&g_health_stats, CIPSEND_TX_TAG_TELEMETRY,
                          mono_now_ms());
    }
}

/* 遥测入队（latest-three）：由 ESP_TrySendTelemetry 择机批量发送。
   tick 为采样时的真实单调毫秒（mono_now_ms），不再是 g_loop_count*5。 */
static void Telemetry_Queue(int16_t s0, int16_t s1, int16_t s2, int16_t s3,
                            int16_t m1, int16_t m2, int16_t m3, int16_t m4,
                            int16_t error, int16_t pid_output,
                            uint32_t tick, int32_t yaw)
{
    uint8_t overwrote;
    if (!g_tcp_client_connected || g_tcp_client_id > 4) {
        telemetry_batch_clear(&s_tele_batch);
        return;
    }
    build_telemetry_frame(s0, s1, s2, s3, m1, m2, m3, m4,
                          error, pid_output, tick, yaw);
    if (telemetry_batch_append(&s_tele_batch, s_tele_frame,
                               TELEMETRY_BATCH_FRAME_SIZE, &overwrote)) {
        hstats_telemetry_generated(&g_health_stats);
        if (overwrote) hstats_telemetry_overwritten(&g_health_stats);
        ESP_TrySendTelemetry();
    }
}

/* 发送二进制诊断帧（可丢，不重试）。若 TX 忙则本次放弃。
   Health baseline: 0x02 健康帧走 CIPSEND_TX_TAG_DIAG_HEALTH（专属归属）；
   0x7E 旧诊断帧仍走 CIPSEND_TX_TAG_DIAG。返回是否成功开启事务（start 成功
   处触发 hstats_tx_started；失败由调用方记 health_dropped）。 */
static uint8_t ESP_SendDiagFrame(const uint8_t *frame, uint16_t frame_len)
{
    uint8_t tag;
    uint8_t started;
    char cmd[24];
    if (!g_tcp_client_connected || g_tcp_client_id > 4) return 0U;
    if (cipsend_tx_busy(&g_cipsend_tx)) return 0U;
    if (twin_control_has_pending_status()) return 0U;
    if (txfq_has_retry(&g_tx_queue)) return 0U;
    if (esp_transport_has_pending_ack()
        || esp_transport_has_pending_status()) return 0U;
    tag = (frame_len >= 4U && frame[2] == HEALTH_FRAME_TYPE)
          ? CIPSEND_TX_TAG_DIAG_HEALTH : CIPSEND_TX_TAG_DIAG;
    build_cipsend_cmd(cmd, frame_len);
    started = cipsend_tx_start(&g_cipsend_tx, cmd, (uint16_t)strlen(cmd),
                               frame, frame_len,
                               CIPSEND_TX_PRIORITY_DROPPABLE, tag,
                               mono_now_ms());
    if (started) {
        hstats_tx_started(&g_health_stats, tag, mono_now_ms());
    }
    return started;
}

/* 发送队列（非阻塞）：ACK → STATUS → telemetry，严格串行。
   每次只尝试开启一个事务；失败时 critical 重试缓冲保留到下一轮。
   critical 帧的可靠性只在当前连接代次内保证：跨连接（代次改变 /
   CLOSED）时旧 ACK/STATUS 会被 txfq 丢弃，不会发给新客户端。 */
static void ESP_SendQueuedFrames(uint8_t allow_telemetry)
{
    char cmd[24];
    uint8_t ack_was_retained;
    uint8_t status_was_retained;
    if (!g_tcp_client_connected || g_tcp_client_id > 4) return;
    if (cipsend_tx_busy(&g_cipsend_tx)) return;

    /* --- ACK: retry existing or fetch new from transport ---
       Health baseline: 取新帧前 txfq_has_ack 已真 = 重发（上笔非 OK 终态）→
       hstats_ack_retry。 */
    ack_was_retained = txfq_has_ack(&g_tx_queue);
    if (!ack_was_retained && esp_transport_has_pending_ack()) {
        char tmp[TX_FRAME_QUEUE_LINE_MAX + 1U];
        uint16_t n = esp_transport_get_pending_ack(tmp, sizeof(tmp));
        txfq_retain_ack(&g_tx_queue, tmp, n);
    }
    if (txfq_has_ack(&g_tx_queue)) {
        if (ack_was_retained) hstats_ack_retry(&g_health_stats);
        build_cipsend_cmd(cmd, txfq_ack_len(&g_tx_queue));
        if (cipsend_tx_start(&g_cipsend_tx, cmd, (uint16_t)strlen(cmd),
                             (const uint8_t *)txfq_ack_ptr(&g_tx_queue),
                             txfq_ack_len(&g_tx_queue),
                             CIPSEND_TX_PRIORITY_CRITICAL, CIPSEND_TX_TAG_ACK,
                             mono_now_ms())) {
            hstats_tx_started(&g_health_stats, CIPSEND_TX_TAG_ACK, mono_now_ms());
        }
        return;   /* 保持 ACK 顺序：STATUS 延后 */
    }

    /* --- STATUS: retry existing or fetch new from transport --- */
    status_was_retained = txfq_has_status(&g_tx_queue);
    if (!status_was_retained && esp_transport_has_pending_status()) {
        char tmp[TX_FRAME_QUEUE_LINE_MAX + 1U];
        uint16_t n = esp_transport_get_pending_status(tmp, sizeof(tmp));
        txfq_retain_status(&g_tx_queue, tmp, n);
    }
    if (txfq_has_status(&g_tx_queue)) {
        if (status_was_retained) hstats_status_retry(&g_health_stats);
        build_cipsend_cmd(cmd, txfq_status_len(&g_tx_queue));
        if (cipsend_tx_start(&g_cipsend_tx, cmd, (uint16_t)strlen(cmd),
                             (const uint8_t *)txfq_status_ptr(&g_tx_queue),
                             txfq_status_len(&g_tx_queue),
                             CIPSEND_TX_PRIORITY_CRITICAL, CIPSEND_TX_TAG_STATUS,
                             mono_now_ms())) {
            hstats_tx_started(&g_health_stats, CIPSEND_TX_TAG_STATUS, mono_now_ms());
        }
        return;
    }

    /* --- Telemetry (latest-wins slot) --- */
    if (allow_telemetry) ESP_TrySendTelemetry();
}

